app/Controllers/Cart.php

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
    public function view()
    {
        $cart = $this->cart->contents();
        $model = new Products();
        $productos = [];

        foreach ($cart as $item) {
            $producto = $model->find($item['id']);

SELECT *
FROM `order`
WHERE `order`.`id` = '3'
SELECT *
FROM `order_details`
WHERE `orderID` = '3'
SELECT *
FROM `envio`
WHERE `orderID` = '3'
 LIMIT 1
SELECT *
FROM `user`
WHERE `user`.`userID` = '2'
SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
    public function comprobante($orderId)
{
    $Order = new Order();
    $OrderDetail = new OrderDetail();
    $Envio = new Envio();
    $User = new Users(); // Supongamos que tienes un modelo User para los datos del usuario
    $Product = new Products(); // Supongamos que tienes un modelo Products para los datos del producto

    $order = $Order->find($orderId);
    $orderDetails = $OrderDetail->where('orderID', $orderId)->findAll();
    $envio = $Envio->where('orderID', $orderId)->first();
    $user = $User->find($order['userID']); // Obtenemos los datos del usuario
    // Obtenemos los nombres de los productos
    foreach ($orderDetails as &$detail) {
        $product = $Product->find($detail['productID']);