app/Controllers/Consultas.php

    public function listar_consultas() {
        $consultaModel = new \App\Models\Consulta();
        $data['consultas'] = $consultaModel->orderBy('id', 'ASC')->paginate(10); // o el número que quieras
---
SELECT *
FROM `consultas`
ORDER BY `id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `consultas`