app/Controllers/Envios.php

    public function index()
    {
        $envios = new Envio();
        $datos['envios'] = $envios->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `envio`
ORDER BY `id` ASC