app/Controllers/LoginController.php

SELECT *
FROM `user`
WHERE `usuario` = 'lagomatias'
 LIMIT 1
UPDATE `user` SET `loggedIn` = 1
WHERE `user`.`userID` IN ('7')
---
    public function auth(){

        $session = session(); //el objeto de sesión se asigna a la variable $session
        $model= new Users(); //instanciamos el modelo

        //traemos los datos del formulario
        $username = $this->request->getPost('usuario');
        $password = $this->request->getPost('password');

        $data = $model->where('usuario', $username)->first(); //consulta sql

        if($data){
            $pass = $data['password'];
               $ba= $data['baja'];
                if ($ba == TRUE){
                     $session->setFlashdata('msg', 'Usuario dado de baja');
                     return redirect()->to('/login');
                 }
                    //Se verifican los datos ingresados para iniciar, si cumple la verificaciòn inicia la sesion
               $verify_pass = password_verify($password, $pass);
                   //password_verify determina los requisitos de configuracion de la contraseña
                   if($verify_pass){
                    $model->update($data['userID'], ['loggedIn' => 1]);