app/Controllers/Logica.php

  public function listadoP_index()
{
    $datos['titulo'] = 'listadoP';


    $productModel = new \App\Models\Productos();


    $products = $productModel->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `products`
ORDER BY `id` ASC

    public function eliminarProducto($id)
    {
        // Instanciar el modelo de productos
          $productModel = new \App\Models\Productos();

        // Obtener el producto por su ID
        $producto = $productModel->find($id);

        // Verificar si el producto existe
        if ($producto === null) {
            // Producto no encontrado, redireccionar con un mensaje de error
            return redirect()->back()->with('error', 'Producto no encontrado');
        }

        // Intentar eliminar el producto
        if ($productModel->delete($id)) {
---
SELECT *
FROM `products`
WHERE `products`.`id` = '19'
DELETE FROM `products`
WHERE `id` IN ('19')