app/Controllers/Orders.php

SELECT *
FROM `order`
ORDER BY `id` ASC
SELECT *
FROM `user`
WHERE `user`.`userID` = '2'
SELECT *
FROM `tipo_Pago`
WHERE `tipo_Pago`.`id` = '1'
---
    public function index()
    {
        $ventas = new Order();
        $datos['ventas'] = $ventas->orderBy('id', 'ASC')->findAll();

        $usuario = new Users();
        $tipoPago = new TipoPago();

        foreach ($datos['ventas'] as &$venta) {
            $email = $usuario->find($venta['userID']);
            $venta['userEmail'] = $email['mail'];

            $pago = $tipoPago->find($venta['tipoPagoId']);