app/Models/Productos.php

SELECT *
FROM `products`
WHERE `categoriaID` = '3'
AND `activado` = 1
---
    public function getByCategoria($categoriaID)
    {
        return $this->where('categoriaID', $categoriaID)
                    ->where('activado', 1)
                    ->findAll();