app/Models/Users.php

    public function marcarComoBaja($id)
    {
        return $this->update($id, ['baja' => 1]);
---
UPDATE `user` SET `baja` = 1
WHERE `user`.`userID` IN ('5')